perf/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60
      arrivalRate: 1
      rampTo: 25
    - name: Steady
      duration: 120
      arrivalRate: 25
    - name: Cooldown
      duration: 30
      arrivalRate: 25
      rampTo: 1

scenarios:
  - name: Rates - Base
    flow:
      - get:
          url: '/rates'